# 1. Напечатать числа от 1 до 10


# 2. Напечатать четные числа от 2 до 20
# for i in range(2, 20, 2):
#     print(i)

# 3. Напечатать числа от 10 до 1 в обратном порядке
# for i in range(10,0,-1):
#     print (i)

# # 4. Напечатать квадраты чисел от 1 до 5
# for i in range(0,5):
#     print (i**2)

fruits = ["яблоко", "банан", "апельсин", "киви", "груша"]

# 5. Напечатать все фрукты из списка
# for i in (fruits):
#     print(i)

# 6. Напечатать фрукты и их длину (количество букв)
# for i in (fruits):
#     print(f"{i} - {len(i)}")

# 7. Напечатать только фрукты, которые начинаются на букву "а"
# for i in (fruits):
#     if i [0] == "а":
#         print(i)

# 8. Создать новый список с фруктами в верхнем регистре
for i in (fruits):
    print()

