# n=int(input("Введите число:"))
# x=range(10)
# # for i in range(n):
# print (list(x))
# # print(x)
# l=[6, 8, 9, 2, 1, 4, 7]
# for i in enumerate(l):
#     print(i)
#
# for i, value in enumerate(l):
#     print(f"{i} {value}")

# k,v,z=[3,5,7,9]
# print(k,v)
# #

# while True:
#     print("Введите 9")
#     x=int(input("Введите число 9"))
#     if x==9:
#         break
#     print("неправильно, попробуй еще")
#
# print("Победа")
#
# while False:
#     print("Победа")

# 1. Напечатать числа от 1 до 10
# l = 10
# for i in range (l):
#     print(i)
# 2. Напечатать четные числа от 2 до 20
# for i in range (2,20+1,2):
#     print(i)
# 3. Напечатать числа от 10 до 1 в обратном порядке
# for i in range (10,0,-1):
#     print (i)
# 4. Напечатать квадраты чисел от 1 до 5
# # for i in range (1,6):
# #     print(i**2)
#
# fruits = ["яблоко", "банан", "апельсин", "киви", "груша"]
#
# # 5. Напечатать все фрукты из списка
# for i in fruits:
#     print(i)
# # 6. Напечатать фрукты и их длину (количество букв)
# for i in fruits:
#     print(i)
#     print(len(i))
# # 7. Напечатать только фрукты, которые начинаются на букву "а"
# for i in fruits:
#     if i [0] == "а":
#         print(i)
# # 8. Создать новый список с фруктами в верхнем регистре
# for i in fruits
#     if i =

text = "программирование"

# 9. Напечатать каждую букву строки на отдельной строке

# 10. Напечатать номер позиции и букву для каждого символа
# 11. Посчитать количество букв "р" в строке
# 12. Создать новую строку, где каждая буква повторяется 2 раза